{
    "map": [
        [],
        [],
        [
            [],
            [],
            [],
            [],
            [ null, null, null, "TiledPath" ],
            [ null, null, null, "Haruka" ],
            [ null, null, null, "TiledPath" ],
            [ null, null, null, "TiledPath" ],
            [ null, null, null, "TiledPath" ],
            [ null, null, null, "DragonPath" ]
        ]
    ],
    "styles": {
      "DragonPath": {
        "title": "Nezumi Enclave - secret passage",
        "description": "The tunnel here is floored in black and white alternating tiles, and lined with smooth-carved walls. Whoever made this place took great care and time, and presumably must clean it regularly. The footsteps outside show it was used quite regularly, but there haven't been new ones since you opened it for yourself.",
        "preview": "The tunnel there connects the Dragonbone Cave to the smooth, tiled tunnels beyond.",
        "events": [
          {
            "chance": 10,
            "event": null
          }
        ],
        "directionOverrides": {
          "sw": {
            "disabled": false,
            "x": 0,
            "y": -10,
            "z": -2,
            "zone": "Dragonbone Cave"
          }
        },
        "light": "white",
        "dark": "black"
      },
      "TiledPath": {
        "title": "Nezumi Enclave - tiled path",
        "description": "Regular and conspiculously clean tiles, alternating black and white, line the path here. The walls are rougher, a mix of nature, old carved walls, and the occasional artistic flair. Skeletal rats, assorted flowers, and geometric shapes line are carved into the wall without rhyme or reason.",
        "preview": "The black and white tiles continue smoothly between artistically carved walls.",
        "events": [
          {
            "chance": 1,
            "event": null
          },
          {
            "chance": 1,
            "event": "flowerthorn"
          },
          {
            "chance": 1,
            "event": "stonebones"
          }
        ],
        "light": "white",
        "dark": "black"
      },
      "Haruka": {
        "title": "Nezumi Enclave - intersection",
        "description": "As you come to an intersection, you are stopped by a red robed figure. She has the head and tail of a rat, though she stands up right in a way your inherited memories tell you indicates she's likely a person. The robe is tight, tied behind her by a massive pink bow.\n\nShe's scentless. Beyond that, her tail idly shifting behind her doesn't so much as stir up a breeze, and even seems to pass a bit into the floor. She's not really here, clearly, yet she looks into your eyes as you approach and smiles.",
        "preview": "There is an intersection there, with black and white tiles going north to south.",
        "events": [
          {
            "chance": 1,
            "event": "HarukaIntro"
          }
        ]
      },
        "FirstIntersection": {
          "title": "Nezumi Enclave - intersection",
          "description": "The path here splits in an intersection. The tiles continue on like you've seen north and south, while the east and west are more rough hewn. A barrier of white powder borders the edge of the tiles. The west smells of rats while the east smells of something less familiar.",
          "preview": "There is an intersection there, with black and white tiles going north to south.",
          "events": [
            {
              "chance": 1,
              "event": null
            }
          ]
        }
      },
  "events": {
    "flowerthorn": {
      "verb": "trap",
      "details": {
        "target": "random one",
        "effect": "damage",
        "accuracy": "10",
        "immunitytags": [ "nezumi" ],
        "damagedie": 4,
        "damagedice": 1,
        "damageplus": 0,
        "damagetype": "piercing",
        "leaderhittext": "A stone thorn launches from one of the carved flowers, piercing your wing membranes painfully!\n",
        "leadermisstext": "A stone thorn launches from one of the carved flowers, bouncing off your scales!\n",
        "leaderkilltext": "A stone thorn launches from one of the carved flowers, piercing your neck!\nIt's stuck in your artery! You can't get it out. You get woozy, the lack of blood flow to your brain impossible to deal with. You can't even! You reject this outcome, ripping back time until you find yourself waking again in your lair.\n",
        "pawnhittext": "A stone thorn launches from one of the carved flowers,  striking one of your {pawn} slaves, injuring {them}! ",
        "pawnkilltext": "A stone thorn launches from one of the carved flowers,  striking one of your {pawn} slaves in the neck! {They} flop to the ground, lifeless!\n",
        "pawnmisstext": "A stone thorn launches from one of the carved flowers,  narrowly missing one of your {pawn} slaves!\n",
        "pawnimmunetext": {
          "nezumi": "One of your {pawn} slaves holds up a hand, stopping you and your entourage. \"Stick to the black tiles for this bit,\" {they} point out, carefully stepping only on the black for several steps."
        }
      }
    },
    "stonebones": {
      "verb": "attack",
      "details": { "enemy": "stonebones" }
    },
    "HarukaIntro": {
      "verb": "first",
      "details": [
        {
          "if": {
            "condition": "stateis",
            "context": "party",
            "fact": "leader/tags/male",
            "rule": "==",
            "value": true
          },
          "verb": "setscene",
          "details": {
            "text": "\"I finally get to meet you, heir of the Redscale dynasty. Well, more or less. My very first prophecy when I was a mere pinky, was that I would live to meet you,\" she smiles sadly. \"The Rat King didn't want to hear the rest of my prophecies. They have me locked away, deep within the Enclaves we Nezumi have built. But you'll come find me, won't you?\"",
            "name": "haruka",
            "sub": "introm",
            "type": "menu"
          }
        },
        {
          "verb": "setscene",
          "details": {
            "text": "\"I finally get to meet you, heir of the Redscale dyn-\" she cuts herself off, blinking in surprise. \"You're.. a female? You wouldn't happen to have a brother, would you?\" Her smile is gone, replaced by an expression mixing disappointment and panic.",
            "name": "haruka",
            "sub": "introf",
            "type": "menu"
          }
        }
      ]
    }
  },
    "actions": {
    }
}